backend/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "updated_at", "meditation_id") VALUES (?, ?, ?, ?)  [["content", "egbetgtb"], ["created_at", "2021-06-07 16:00:02.124959"], ["updated_at", "2021-06-07 16:00:02.124959"], ["meditation_id", 1]]
---
      def create
        comment = Comment.new(comment_params)
        if comment.save