backend/app/controllers/meditations_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."meditation_id" IN (?, ?, ?)  [[nil, 2], [nil, 3], [nil, 4]]
SELECT "meditations".* FROM "meditations" ORDER BY "meditations"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
      def index
        meditations = Meditation.includes(:comments)

INSERT INTO "meditations" ("created_at", "updated_at", "text") VALUES (?, ?, ?)  [["created_at", "2021-06-03 14:40:06.302404"], ["updated_at", "2021-06-03 14:40:06.302404"], ["text", "d"]]
---
      def create
        meditation = Meditation.new(meditation_params)
        if meditation.save

SELECT "meditations".* FROM "meditations" WHERE "meditations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "meditations" SET "updated_at" = ? WHERE "meditations"."id" = ?  [["updated_at", "2021-06-17 14:30:39.804961"], ["id", 8]]
---
      def update
        meditation = Meditation.find(meditation_params[:id])
        if meditation.update(meditation_params)

SELECT "meditations".* FROM "meditations" WHERE "meditations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "meditations" WHERE "meditations"."id" = ?  [["id", 2]]
---
      def destroy
        meditation = Meditation.find(meditation_params[:id])
        meditation.destroy

SELECT "meditations".* FROM "meditations" WHERE "meditations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "meditations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-06-06 20:08:59.171225"], ["updated_at", "2021-06-06 20:08:59.171225"]]
---
      def attach_audio
        meditation = Meditation.find(params[:id])
        a = meditation.audio.attach(meditation_params[:audio])