backend/app/controllers/meditations_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."meditation_id" = ?  [["meditation_id", 2]]
---
      def index
        meditations = Meditation.all
        hash = {}
        meditations.each do |meditation|
          meditation_id = meditation.id
          audio = meditation.audio
          title = meditation.title
          url = Rails.application.routes.url_helpers.rails_blob_url(audio, only_path: true)
          comments = meditation.comments.all